Выполните 12 улучшений имён функций/методов в вашем коде в формате "было - стало - ваш комментарий", и выложите на гитхаб.
square - calc_square # ООП. Полиморфизм/ Было непонятно, что именно делает метод
perimeter - calc_perimeter # ООП. Полиморфизм/ Было непонятно, что именно делает метод
change - change_parameters # ООП. Методы/ Было непонятно, что именно меняет метод
check - check_time / check_date # ООП. Методы/ Было непонятно, что именно проверяет метод
display - display_message # ООП. Методы/ Было непонятно, что именно выводит метод
_clear - _remove_branch_and_adjacent # TreeOfLife / Было совсем не информативное имя метода
remove_branches - remove_old_branches # TreeOfLife/ Добавил уточнение в имя метода
report - generate_report # TreeOfLife/ Добавил уточнение в имя метода
new_sprig - create_sprig # TreeOfLife/ Добавил уточнение в имя метода
growth - grow # TreeOfLife/ исправил существительное на глагол, чуть более точное соответствие
# Больше улучшать нечего (остальное либо совсем однотипное, либо достаточно хорошо соответствует коду)